rails/rottenpotatoes/app/controllers/movies_controller.rb

  def index
    if params[:ratings]
      @ratings = params[:ratings].keys
      Movie.ratings.each_pair do |rating,value|
        if @ratings.include? rating
          Movie.ratings()[rating] = true
        else
          Movie.ratings()[rating] = false
        end
      end
    end
    @ratings = Movie.ratings().select { |rating,status| if status ; rating ; end }.keys unless @ratings
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC